import { Component, AfterViewInit, ElementRef, Inject } from '@angular/core';
import { NgFor, NgIf, isPlatformBrowser } from '@angular/common';
import { PLATFORM_ID } from '@angular/core';

@Component({
  selector: 'app-books',
  standalone: true,
  imports: [NgFor, NgIf],
  templateUrl: './books.html',
  styleUrl: './books.css',
})
export class Books implements AfterViewInit {
  books = [
    {
      title: 'جسدي ملكي',
      year: '2025',
      image: 'assets/Book5.jpg',
      publisher: 'دار نشر ملهمون الامارات',
      details:
        'بات من الضروري الاهتمام بجميع جوانب التربية للطفل لتنمية جميع جوانب الشخصية ومراعان النمو النفسي والاجتماعي والفسيولوجي للطفل، ومن اهم هذه الجوانب كجزء منها هو التربية الجنسية وهي أيضاً ما تسمى بعملية التنشئة الاجتماعية والتي تقوم بها الأسرة تجاه افرادها والتي تشمل جميع عمليات التطبيع والتلقين والتعليم لما هو مقبول في المجتمع الذي تنتمي اليه، فعملية التطبيع الاجتماعي للطفل لا تقتصر على تعليم الطفل الأكل والشرب فقط بل تتعدى الى غرس القيم والمعايير التي تجعل الطفل مسؤولا وعضوا مقتدرا في المجتمع، بما فيها التطبيع الجنسي او التربية الجنسية للطفل واتي تعتبر جزء مهم من عملية التنشئة الاجتماعية ',
    },
    {
      title: 'صناعة الكاريزما للطفل والمراهق',
      year: '2024',
      image: 'assets/Book2.jpg',
      publisher: 'دار نشر دارك مصر',
      details:
        'نحن بحاجة إلى تنمية ثقافة القيادة، لمنح الأطفال الثقة والمهارات اللازمة للقيادة، فالشخصية ليست شيئًا يمكننا تعليمه لأطفالنا على قطعة من الورق... لكنه شيء يمكننا إظهاره لهم بمرور الوقت كمجموع لأعمالنا اليومية من خلال دورنا كآباء وأمهات.',
    },
    {
      title: 'تطور شخصية الشاب والمراهق',
      year: '2021',
      image: 'assets/Book1.jpg',
      publisher: 'دار نشر حروف منثورة مصر',
      details:
        'قمنا بكتابة مجموعة قصصية تعمل على تطور شخصية الانسان ، وخاصة في مرحلة المراهقة والبلوع ، والشباب ايضاً ، حتى يكون لنا ولو دور بسيط في تنمية شخصية المراهق او الشاب، وتعزيز القيم الأخلاقية المناسبة لمجتماعتنا العربية والعمل على التمسك بها مع التطلع الى مستقبل أفضل من خلال شبابنا وبناتنا ',
    },
    {
      title: 'إيجابية طفلك',
      year: '2021',
      image: 'assets/Book4.jpg',
      publisher: 'دار نهضة مصر للنشر',
      details:
        'هو كتاب تربوي يتحدث عن كيفية بناء الشخصية السوية للطفل في سنوات عمره الأولى والأساليب المناسبة لذلك ... كما يتطرق للعديد من المواقف التي يواجهها الوالدان أثناء التربية وكيفية حل تلك المواقف وخوضها بشكل صحيح يضمن الوصول للنتائج الإيجابية التي ستساهم في تربية الطفل وتصويب سلوكياته، كما تم الاعتماد على بعض القصص لتوضيح المعنى وتقريبه، إضافة لبعض الأخطاء التي يواجهها الوالدان في التربية وكيفية تجنبها واتخاذ البدائل السليمة لها.',
    },
    {
      title: 'تسامح و سلام : دعوة للتسامح',
      year: '2021',
      image: 'assets/Book6.jpg',
      publisher: 'دار نشر مركز نهر النيل مصر',
      details:
        'طرح قضية التسامح بشكل عصري و جذاب ، و فيه حاول الكاتب أن يوضح حقيقةً مفادُها بأنَّ التسامح أصبح ضرورة ملحة من ضرورات هذا العصر لحياةٍ متوازنة و سليمة ، و لمستقبلٍ حضاريِّ منفتح برؤيةٍ خلاقة نحو الرقي و الازدهار ',
    },
    {
      title: 'دليل الإباء والامهات لطرق تحسين ذكاء أطفالهم',
      year: '2019',
      image: 'assets/Book3.jpg',
      publisher: 'دار نشر ملهمون الامارات',
      details:
        'كان هدفنا الأول و الأسمى لكتابة كل كلمة في هذا الكتاب هو بعث الثقة في الأولياء و خاصة الأمهات من أجل الاهتمام بتحسين مستوى الذكاء عند أطفالهم، فهذا الكتاب موجه لكل أم ترى أنّ طفلها سيكون شخصا عاديا و غير مهم و أنه ليس ذكيا. لكل أم تعتقد أنّ الذكاء وراثي و لا يمكن تغييره ابنك سيكون شخصا عظيما ومختلفا إذا وضعت هذا هدفا نصب عينيك وبخطوات بسيطة و نشاطات سهلة تشرحها سطور هذا الكتاب يمكن أن تجعلي من طفلك عبقريا و شخصا ناجحا في جميع مناحي الحياة',
    },
  ];

  selectedBook: any = null;

  constructor(
    private el: ElementRef,
    @Inject(PLATFORM_ID) private platformId: Object
  ) {}

  ngAfterViewInit() {
    if (!isPlatformBrowser(this.platformId)) return;

    const fadeElements = this.el.nativeElement.querySelectorAll('.fade-in');
    const observer = new IntersectionObserver(
      (entries) => {
        entries.forEach((entry) => {
          if (entry.isIntersecting) {
            entry.target.classList.add('visible');
            observer.unobserve(entry.target);
          }
        });
      },
      { threshold: 0.2 }
    );
    fadeElements.forEach((el: Element) => observer.observe(el));
  }

  showDetails(book: any) {
    this.selectedBook = book;
  }

  closeDetails() {
    this.selectedBook = null;
  }
}
